{"headline":"Google COVID-19 mobility reports","standfirst":"An exploration","section_one_text":[{"type":"text","value":"Google has made hundreds of megabytes of anonymised location data gathered from smartphones available for anyone to download for free."},{"type":"text","value":"The stated aim is to help public health officials plan policies in response to the COVID-19 pandemic by allowing them to learn how their citizens's movements have changed since the start of the pandemic and in response to lockdown restrictions."},{"type":"text","value":"The data are broken down by categories of places that people may visit or travel through. These categories include grocery and pharmacy, parks, transit stations, retail & recreation, residential and workplaces."},{"type":"text","value":"This map shows the data for just one category, parks. Google's definition of parks includes local and national parks as well as public beaches, marinas, dog parks, plazas, and public gardens."},{"type":"text","value":"A blue spike on the map indicates an increase in visits and length of stay at this location whereas a red spike indicates a decrease, relative to a baseline value. Google defines this baseline as the median value, for the corresponding day of the week, during a 5 week period from January 3<sup>rd</sup> to Feb 6<sup>th</sup> in 2020."},{"type":"text","value":"The map shows data from February 15<sup>th</sup> 2020 through to May 21<sup>st</sup> 2021, a period of 462 days covering the worst of the pandemic. As you scroll down the page the map will move forward through time."},{"type":"text","value":"Each spike represents a location defined as <code>sub_category_1</code> by Google. These are locations within an individual country, such as the states of the United States of America or the counties of England."},{"type":"text","value":"Each location in the dataset is given a unique <a href=\"https://developers.google.com/maps/documentation/places/web-service/place-id\">Google Place ID</a>. This allows us to use the <a href=\"https://developers.google.com/maps\">Google Maps Places API</a> to reference latitude and longitude coordinates for each location so that they can be plotted on the map."},{"type":"text","value":"The spikes represent a seven day rolling average of the Google data. This allows us to more clearly see trends emerging between locations over time by smoothing out fluctuations between individual days."},{"type":"text","value":"Visits to parks are obviously very weather dependent, with only the most ardent dog walkers venturing out during a rainstorm. Park use is also highly dependent on the season. We can see that parks were a lot busier north of the equator during the summer months in the Northern Hemisphere."},{"type":"text","value":"The data is provided with plenty of caveats. Google does not recommend using the data for any medical purposes nor for planning personal travel."}],"section_two_headline":"Europe","section_two_text":[{"type":"text","value":"Zooming into Europe and moving back to February 2015, we can now look at spikes for locations defined as <code>sub_category_2</code>. The locations here are more granular, for example each of the boroughs of London are represented - rather than just one spike for the whole of Greater London."},{"type":"text","value":"Google's data does not provide any <code>sub_category_2</code> locations in places such as Ireland, Northern Ireland, Scotland, Wales or Germany. It is unclear why these locations have been omitted."},{"type":"text","value":"Google states that they will leave a region or category out of the dataset if there isn't sufficient statistically significant levels of data."}],"section_three_headline":"The United States of America","section_three_text":[{"type":"text","value":"Moving over to the USA and back to February 2015 once again we can look more closely at <code>sub_category_2</code> locations within each state."},{"type":"text","value":"Google insists that the data aderes to their stringent privacy protocols and that it should not be possible to personally identify any individual from this dataset."},{"type":"text","value":"To be included in this dataset users with a Google account and apps such as Google Maps installed on their smartphones must also choose to turn on 'Location History' in their account settings, which is off by default."},{"type":"text","value":"Less anonymous data could be used to contact trace individuals receiving a positive test result for COVID-19 and to set up a ‘digital fence’ around those quarantining to ensure they comply with restrictions to their movement, as was done in Taiwan."}],"section_four_headline":"Share and share alike","section_four_text":[{"type":"text","value":"Does this signal a new period of big tech cooperation with governments around the world? Apple and Facebook have also released similar mobility datasets and throughout the pandemic tech firms have been offering assistance to governments, such as through the <a href=\"https://developers.google.com/android/exposure-notifications/exposure-notifications-api\">Exposure Notifications API</a> - a joint venture from Google and Apple useful for building apps that give notifications of possible exposure COVID-19."},{"type":"text","value":"Tech firms have in the past been reticent to help governments with law enforcement and anti-terrorist actions."},{"type":"text","value":"For instance in 2019 Facebook refused to break the end-to-end encryption in its instant messaging services when asked to do so in an open letter from amongst others, US Attorney General William Barr and UK Home Secretary Priti Patel."},{"type":"text","value":"The British government also initially refused the help of both Google and Apple in the development of their contact tracing smartphone app, preferring instead to attempt to build their own system based on Bluetooth connections between devices."},{"type":"text","value":"Ultimately any tool which can help stem the spread of this pandemic helps everyone. Governments, their citizens and the many millions of users that Google wishes to serve targeted advertising to."}],"footer_text":[{"type":"text","value":"The code for this page can be viewed on <a href=\"https://github.com/chris-creditdesign/google-covid-19-mobility-report-exploration\">GitHub</a>."},{"type":"text","value":"Data from Google LLC <i><a href=\"https://www.google.com/covid19/mobility/\">\"Google COVID-19 Community Mobility Reports\"</a></i>.  Accessed: 25<sup>th</sup> May 2020."}]}